type LogoProps = {
    size: number;
}

export function Logo({ size }: LogoProps) {
    return (
        <svg version="1.1" viewBox="0 0 1024 1024" width={size} height={size}>
            <defs>
                <linearGradient id="_名称未設定グラデーション_9" data-name="名称未設定グラデーション 9" x1="73.438" y1="73.438" x2="950.562" y2="950.563" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#b3e5fc" />
                    <stop offset="1" stopColor="#00b0ff" />
                </linearGradient>
                <linearGradient id="_名称未設定グラデーション_140" data-name="名称未設定グラデーション 140" x1="73.438" y1="73.438" x2="950.562" y2="950.563" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#e1f5fe" />
                    <stop offset="1" stopColor="#0091ea" stopOpacity=".5" />
                </linearGradient>
                <filter id="drop-shadow-1" x="58" y="207" width="918" height="769" filterUnits="userSpaceOnUse">
                    <feOffset dx="5" dy="5" />
                    <feGaussianBlur result="blur" stdDeviation="25" />
                    <feFlood floodColor="#0277bd" floodOpacity=".25" />
                    <feComposite in2="blur" operator="in" />
                    <feComposite in="SourceGraphic" />
                </filter>
                <linearGradient id="_名称未設定グラデーション_26" data-name="名称未設定グラデーション 26" x1="270.034" y1="331.43" x2="793.733" y2="855.128" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#fff" />
                    <stop offset=".475" stopColor="#fdfefe" />
                    <stop offset=".646" stopColor="#f6fcfe" />
                    <stop offset=".768" stopColor="#eaf7fe" />
                    <stop offset=".867" stopColor="#d9f2fd" />
                    <stop offset=".951" stopColor="#c3eafc" />
                    <stop offset="1" stopColor="#b3e5fc" />
                </linearGradient>
                <linearGradient id="_名称未設定グラデーション_36" data-name="名称未設定グラデーション 36" x1="257.949" y1="444.149" x2="348.169" y2="534.369" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#ef9a9a" />
                    <stop offset="1" stopColor="#f44336" />
                </linearGradient>
                <linearGradient id="_名称未設定グラデーション_54" data-name="名称未設定グラデーション 54" x1="445.56" y1="372.054" x2="533.526" y2="460.02" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#a5d6a7" />
                    <stop offset="1" stopColor="#4caf50" />
                </linearGradient>
                <linearGradient id="_名称未設定グラデーション_62" data-name="名称未設定グラデーション 62" x1="641.367" y1="397.52" x2="727.853" y2="484.007" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#90caf9" />
                    <stop offset="1" stopColor="#2196f3" />
                </linearGradient>
                <filter id="drop-shadow-2" x="677" y="58" width="299" height="300" filterUnits="userSpaceOnUse">
                    <feOffset dx="5" dy="5" />
                    <feGaussianBlur result="blur1" stdDeviation="25" />
                    <feFlood floodColor="#0277bd" floodOpacity=".25" />
                    <feComposite in2="blur1" operator="in" />
                    <feComposite in="SourceGraphic" />
                </filter>
                <linearGradient id="_名称未設定グラデーション_74" data-name="名称未設定グラデーション 74" x1="783.831" y1="170.818" x2="859.203" y2="246.19" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#fff" />
                    <stop offset=".475" stopColor="#fdfefe" />
                    <stop offset=".646" stopColor="#f6fcfe" />
                    <stop offset=".768" stopColor="#eaf7fe" />
                    <stop offset=".867" stopColor="#d9f2fd" />
                    <stop offset=".951" stopColor="#c3eafc" />
                    <stop offset="1" stopColor="#b3e5fc" />
                </linearGradient>
            </defs>
            <g id="background">
                <rect width="1024" height="1024" rx="250" ry="250" fill="url(#_名称未設定グラデーション_9)" />
                <path d="M774,10c32.249,0,63.593,6.369,93.16,18.93,28.557,12.132,54.239,29.485,76.331,51.578,22.093,22.093,39.446,47.774,51.578,76.331,12.561,29.567,18.93,60.911,18.93,93.16v524c0,32.249-6.369,63.593-18.93,93.16-12.132,28.557-29.485,54.239-51.578,76.331-22.093,22.093-47.774,39.446-76.331,51.578-29.567,12.561-60.911,18.93-93.16,18.93H250c-32.249,0-63.593-6.369-93.16-18.93-28.557-12.132-54.239-29.485-76.331-51.578-22.093-22.093-39.446-47.774-51.578-76.331-12.561-29.567-18.93-60.911-18.93-93.16V250c0-32.249,6.369-63.593,18.93-93.16,12.132-28.557,29.485-54.239,51.578-76.331,22.093-22.093,47.774-39.446,76.331-51.578,29.567-12.561,60.911-18.93,93.16-18.93h524M774,0H250C112.5,0,0,112.5,0,250v524c0,137.5,112.5,250,250,250h524c137.5,0,250-112.5,250-250V250C1024,112.5,911.5,0,774,0h0Z" fill="url(#_名称未設定グラデーション_140)" />
            </g>
            <g id="artwork">
                <g id="palette">
                    <g filter="url(#drop-shadow-1)">
                        <path id="base" d="M895.861,683.162c-1.035-31.62-18.813-59.797-46.595-74.969-20.677-12.519-47.516-16.799-62.744-36.98-14.452-19.012-2.957-42.81,14.398-55.326,11.651-9.126,27.316-14.289,39.077-24.13,38.293-29.918,13.55-84.937-13.302-114.158-81.331-88.97-229.876-106.78-344.203-98.183-144.783,9.604-311.145,80.317-346.837,234.738-40.336,173.534,84.322,307.892,242.499,355.975,67.013,20.564,137.999,28.185,208.091,24.445,63.238-4.502,126.973-16.341,184.054-44.704,64.238-31.005,129.112-89.54,125.562-166.706ZM631.866,889.23c-.142.029-.809.074-.897.042.219-.017.844-.056.973-.053l-.075.011ZM695.48,708.667c-22.665-2.755-48.386-17.555-50.887-42.415-3.416-43.497,50.737-63.147,84.411-43.299l.143.08c15.033,8.407,26.747,23.854,26.868,41.511-.177,33.26-30.905,47.332-60.535,44.123Z" fill="url(#_名称未設定グラデーション_26)" />
                    </g>
                    <g id="paints">
                        <path id="red" d="M364.605,489.364c0,11.386-2.464,21.771-7.783,30.965-5.488,9.485-11.846,19.501-21.331,24.988-9.194,5.319-20.92,8.355-32.306,8.355s-23.293-2.722-32.487-8.041c-9.485-5.488-16.165-15.525-21.653-25.011-5.319-9.194-7.032-19.871-7.032-31.257s-.253-23.2,5.066-32.394c5.488-9.485,15.238-16.476,24.723-21.964,9.194-5.319,19.997-9.298,31.383-9.298s20.824,6.337,30.018,11.656c9.485,5.488,21.141,9.808,26.628,19.293,5.319,9.194,4.773,21.321,4.773,32.707Z" fill="url(#_名称未設定グラデーション_36)" />
                        <path id="green" d="M550.183,415.451c0,11.386-.978,21.606-6.298,30.8-5.488,9.485-12.785,17.549-22.27,23.037-9.194,5.319-19.696,11.546-31.081,11.546s-23.604-3.259-32.798-8.579c-9.485-5.488-14.651-16.759-20.139-26.244-5.319-9.194-9.584-19.175-9.584-30.561s2.459-22.411,7.778-31.605c5.488-9.485,14.571-16.062,24.056-21.55,9.194-5.319,19.301-8.085,30.687-8.085s20.506,4.471,29.7,9.79c9.485,5.488,19.533,10.372,25.02,19.857,5.319,9.194,4.929,20.206,4.929,31.592Z" fill="url(#_名称未設定グラデーション_54)" />
                        <path id="blue" d="M745.459,441.091c0,11.386-3.245,20.569-8.564,29.763-5.488,9.485-11.614,17.511-21.1,22.999-9.194,5.319-19.074,11.995-30.46,11.995s-21.065-7.023-30.259-12.342c-9.485-5.488-20.745-10.313-26.233-19.798-5.319-9.194-4.798-21.232-4.798-32.617s1.552-22.223,6.872-31.417c5.488-9.485,14.896-15.127,24.381-20.615,9.194-5.319,18.651-11.656,30.037-11.656s20.721,6.548,29.914,11.867c9.485,5.488,20.597,10.003,26.085,19.488,5.319,9.194,4.124,20.947,4.124,32.332Z" fill="url(#_名称未設定グラデーション_62)" />
                    </g>
                </g>
                <g filter="url(#drop-shadow-2)">
                    <path id="sparkle" d="M818.042,132.385c1.911-5.165,5.039-5.165,6.95,0l14.657,39.611c1.911,5.165,7.701,10.954,12.866,12.866l39.611,14.657c5.165,1.911,5.165,5.039,0,6.95l-39.611,14.657c-5.165,1.911-10.954,7.701-12.866,12.866l-14.657,39.611c-1.911,5.165-5.039,5.165-6.95,0l-14.657-39.611c-1.911-5.165-7.701-10.954-12.866-12.866l-39.611-14.657c-5.165-1.911-5.165-5.039,0-6.95l39.611-14.657c5.165-1.911,10.954-7.701,12.866-12.866l14.657-39.611Z" fill="url(#_名称未設定グラデーション_74)" />
                </g>
            </g>
        </svg>
    )
}

export function LogoStroke({ size }: LogoProps) {
    return (
        <svg version="1.1" viewBox="0 0 1024 1024" width={size} height={size}>
            <defs>
                <linearGradient id="_名称未設定グラデーション_9" data-name="名称未設定グラデーション 9" x1="73.438" y1="73.438" x2="950.562" y2="950.563" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#b3e5fc" />
                    <stop offset="1" stopColor="#00b0ff" />
                </linearGradient>
                <linearGradient id="_名称未設定グラデーション_140" data-name="名称未設定グラデーション 140" x1="73.438" y1="73.438" x2="950.562" y2="950.563" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#e1f5fe" />
                    <stop offset="1" stopColor="#0091ea" stopOpacity=".5" />
                </linearGradient>
                <filter id="drop-shadow-1" x="58" y="207" width="918" height="769" filterUnits="userSpaceOnUse">
                    <feOffset dx="5" dy="5" />
                    <feGaussianBlur result="blur" stdDeviation="25" />
                    <feFlood floodColor="#0277bd" floodOpacity=".25" />
                    <feComposite in2="blur" operator="in" />
                    <feComposite in="SourceGraphic" />
                </filter>
                <linearGradient id="_名称未設定グラデーション_26" data-name="名称未設定グラデーション 26" x1="270.034" y1="331.43" x2="793.733" y2="855.128" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#fff" />
                    <stop offset=".475" stopColor="#fdfefe" />
                    <stop offset=".646" stopColor="#f6fcfe" />
                    <stop offset=".768" stopColor="#eaf7fe" />
                    <stop offset=".867" stopColor="#d9f2fd" />
                    <stop offset=".951" stopColor="#c3eafc" />
                    <stop offset="1" stopColor="#b3e5fc" />
                </linearGradient>
                <linearGradient id="_名称未設定グラデーション_36" data-name="名称未設定グラデーション 36" x1="257.949" y1="444.149" x2="348.169" y2="534.369" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#ef9a9a" />
                    <stop offset="1" stopColor="#f44336" />
                </linearGradient>
                <linearGradient id="_名称未設定グラデーション_54" data-name="名称未設定グラデーション 54" x1="445.56" y1="372.054" x2="533.526" y2="460.02" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#a5d6a7" />
                    <stop offset="1" stopColor="#4caf50" />
                </linearGradient>
                <linearGradient id="_名称未設定グラデーション_62" data-name="名称未設定グラデーション 62" x1="641.367" y1="397.52" x2="727.853" y2="484.007" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#90caf9" />
                    <stop offset="1" stopColor="#2196f3" />
                </linearGradient>
                <filter id="drop-shadow-2" x="677" y="58" width="299" height="300" filterUnits="userSpaceOnUse">
                    <feOffset dx="5" dy="5" />
                    <feGaussianBlur result="blur1" stdDeviation="25" />
                    <feFlood floodColor="#0277bd" floodOpacity=".25" />
                    <feComposite in2="blur1" operator="in" />
                    <feComposite in="SourceGraphic" />
                </filter>
                <linearGradient id="_名称未設定グラデーション_74" data-name="名称未設定グラデーション 74" x1="783.831" y1="170.818" x2="859.203" y2="246.19" gradientUnits="userSpaceOnUse">
                    <stop offset="0" stopColor="#fff" />
                    <stop offset=".475" stopColor="#fdfefe" />
                    <stop offset=".646" stopColor="#f6fcfe" />
                    <stop offset=".768" stopColor="#eaf7fe" />
                    <stop offset=".867" stopColor="#d9f2fd" />
                    <stop offset=".951" stopColor="#c3eafc" />
                    <stop offset="1" stopColor="#b3e5fc" />
                </linearGradient>
            </defs>
            <g id="background">
                <rect width="1024" height="1024" rx="250" ry="250" fill="url(#_名称未設定グラデーション_9)" />
                <path d="M774,10c32.249,0,63.593,6.369,93.16,18.93,28.557,12.132,54.239,29.485,76.331,51.578,22.093,22.093,39.446,47.774,51.578,76.331,12.561,29.567,18.93,60.911,18.93,93.16v524c0,32.249-6.369,63.593-18.93,93.16-12.132,28.557-29.485,54.239-51.578,76.331-22.093,22.093-47.774,39.446-76.331,51.578-29.567,12.561-60.911,18.93-93.16,18.93H250c-32.249,0-63.593-6.369-93.16-18.93-28.557-12.132-54.239-29.485-76.331-51.578-22.093-22.093-39.446-47.774-51.578-76.331-12.561-29.567-18.93-60.911-18.93-93.16V250c0-32.249,6.369-63.593,18.93-93.16,12.132-28.557,29.485-54.239,51.578-76.331,22.093-22.093,47.774-39.446,76.331-51.578,29.567-12.561,60.911-18.93,93.16-18.93h524M774,0H250C112.5,0,0,112.5,0,250v524c0,137.5,112.5,250,250,250h524c137.5,0,250-112.5,250-250V250C1024,112.5,911.5,0,774,0h0Z" fill="url(#_名称未設定グラデーション_140)" />
            </g>
            <g id="artwork">
                <g id="palette">
                    <g filter="url(#drop-shadow-1)">
                        <path id="base" d="M895.861,683.162c-1.035-31.62-18.813-59.797-46.595-74.969-20.677-12.519-47.516-16.799-62.744-36.98-14.452-19.012-2.957-42.81,14.398-55.326,11.651-9.126,27.316-14.289,39.077-24.13,38.293-29.918,13.55-84.937-13.302-114.158-81.331-88.97-229.876-106.78-344.203-98.183-144.783,9.604-311.145,80.317-346.837,234.738-40.336,173.534,84.322,307.892,242.499,355.975,67.013,20.564,137.999,28.185,208.091,24.445,63.238-4.502,126.973-16.341,184.054-44.704,64.238-31.005,129.112-89.54,125.562-166.706ZM631.866,889.23c-.142.029-.809.074-.897.042.219-.017.844-.056.973-.053l-.075.011ZM695.48,708.667c-22.665-2.755-48.386-17.555-50.887-42.415-3.416-43.497,50.737-63.147,84.411-43.299l.143.08c15.033,8.407,26.747,23.854,26.868,41.511-.177,33.26-30.905,47.332-60.535,44.123Z" fill="url(#_名称未設定グラデーション_26)" />
                    </g>
                    <g id="paints">
                        <path id="red" d="M364.605,489.364c0,11.386-2.464,21.771-7.783,30.965-5.488,9.485-11.846,19.501-21.331,24.988-9.194,5.319-20.92,8.355-32.306,8.355s-23.293-2.722-32.487-8.041c-9.485-5.488-16.165-15.525-21.653-25.011-5.319-9.194-7.032-19.871-7.032-31.257s-.253-23.2,5.066-32.394c5.488-9.485,15.238-16.476,24.723-21.964,9.194-5.319,19.997-9.298,31.383-9.298s20.824,6.337,30.018,11.656c9.485,5.488,21.141,9.808,26.628,19.293,5.319,9.194,4.773,21.321,4.773,32.707Z" fill="url(#_名称未設定グラデーション_36)" />
                        <path id="green" d="M550.183,415.451c0,11.386-.978,21.606-6.298,30.8-5.488,9.485-12.785,17.549-22.27,23.037-9.194,5.319-19.696,11.546-31.081,11.546s-23.604-3.259-32.798-8.579c-9.485-5.488-14.651-16.759-20.139-26.244-5.319-9.194-9.584-19.175-9.584-30.561s2.459-22.411,7.778-31.605c5.488-9.485,14.571-16.062,24.056-21.55,9.194-5.319,19.301-8.085,30.687-8.085s20.506,4.471,29.7,9.79c9.485,5.488,19.533,10.372,25.02,19.857,5.319,9.194,4.929,20.206,4.929,31.592Z" fill="url(#_名称未設定グラデーション_54)" />
                        <path id="blue" d="M745.459,441.091c0,11.386-3.245,20.569-8.564,29.763-5.488,9.485-11.614,17.511-21.1,22.999-9.194,5.319-19.074,11.995-30.46,11.995s-21.065-7.023-30.259-12.342c-9.485-5.488-20.745-10.313-26.233-19.798-5.319-9.194-4.798-21.232-4.798-32.617s1.552-22.223,6.872-31.417c5.488-9.485,14.896-15.127,24.381-20.615,9.194-5.319,18.651-11.656,30.037-11.656s20.721,6.548,29.914,11.867c9.485,5.488,20.597,10.003,26.085,19.488,5.319,9.194,4.124,20.947,4.124,32.332Z" fill="url(#_名称未設定グラデーション_62)" />
                    </g>
                </g>
                <g filter="url(#drop-shadow-2)">
                    <path id="sparkle" d="M818.042,132.385c1.911-5.165,5.039-5.165,6.95,0l14.657,39.611c1.911,5.165,7.701,10.954,12.866,12.866l39.611,14.657c5.165,1.911,5.165,5.039,0,6.95l-39.611,14.657c-5.165,1.911-10.954,7.701-12.866,12.866l-14.657,39.611c-1.911,5.165-5.039,5.165-6.95,0l-14.657-39.611c-1.911-5.165-7.701-10.954-12.866-12.866l-39.611-14.657c-5.165-1.911-5.165-5.039,0-6.95l39.611-14.657c5.165-1.911,10.954-7.701,12.866-12.866l14.657-39.611Z" fill="url(#_名称未設定グラデーション_74)" />
                </g>
            </g>
            <rect x="20" y="20" width="984" height="984" rx="230" ry="230" fill="none" stroke="white" strokeWidth="64"
            />
        </svg>
    )
}